package ru.yandex.practicum.filmorate;

public class Questions {

    /*

    Вопросы:
    1. Не смог по доп. заданию сделать валидацию аннотацией для Duration>0 и LocalData after 28.12.1895.
    Можно ли было как то сделать без написания собственных валидаторов?
    2. При аннотации @Data все объявляемые переемнные делаем final. Из-за этого в контроллерах пришлось делать методы,
    пересоздающие объект, если в процессе его надо как-то поменять (установить ID, например). Это нормально?
     */
}
